# example interaction with graphs and dijkstras

```scheme
> (define G (make-graph))
> ((G 'add-vertex!) 'briggs)
> ((G 'add-vertex!) 'rat)
> ((G 'add-vertex!) 'library)
> ((G 'add-vertex!) 'rhodes-tower)
> ((G 'get-vertices))
'(rhodes-tower library rat briggs)
> ((G 'add-edge!) 'briggs 'rat 3)
> ((G 'add-edge!) 'rat 'rhodes-tower 7)
> ((G 'add-edge!) 'library 'rhodes-tower 5)
> ((G 'add-edge!) 'library 'briggs 4)
> ((G 'get-weight) 'briggs 'rat)
3
> ((G 'get-neighbors) 'briggs)
'(rat library)
> ((G 'get-neighbors) 'rat)
'(briggs rhodes-tower)
> (dijkstra G 'briggs 'rhodes-tower)
'((briggs library rhodes-tower) . 9)
> (define G3 (make-graph))
> ((G3 'add-vertex!) 'a)
> ((G3 'add-vertex!) 'b)
> ((G3 'add-vertex!) 'c)
> ((G3 'add-vertex!) 'd)
> ((G3 'add-vertex!) 'e)
> ((G3 'add-vertex!) 'f)
> ((G3 'add-vertex!) 'g)
> ((G3 'add-vertex!) 'h)
> ((G3 'add-vertex!) 'i)
> ((G3 'add-edge!) 'a 'b 2)
> ((G3 'add-edge!) 'a 'd 6)
> ((G3 'add-edge!) 'a 'c 3)
> ((G3 'add-edge!) 'b 'd 3)
> ((G3 'add-edge!) 'c 'd 6)
> ((G3 'add-edge!) 'd 'e 7)
> ((G3 'add-edge!) 'd 'h 3)
> ((G3 'add-edge!) 'd 'i 6)
> ((G3 'add-edge!) 'e 'f 6)
> ((G3 'add-edge!) 'f 'g 5)
> ((G3 'add-edge!) 'f 'i 3)
> ((G3 'add-edge!) 'g 'h 8)
> ((G3 'add-edge!) 'g 'i 3)
> ((G3 'add-edge!) 'h 'i 2)
> (dijkstra G3 'a 'i)
'((a b d h i) . 10)
```
